#ifndef OB_UPS_PROCEDURE_SPECIAL_EXECUTOR_H
#define OB_UPS_PROCEDURE_SPECIAL_EXECUTOR_H
#include "sql/ob_sp_procedure.h"
#include "ob_session_mgr.h"
#include "ob_table_mgr.h"
#include "ob_ups_table_mgr.h"
using namespace oceanbase::sql;
namespace oceanbase
{
  namespace updateserver
  {
    class ObUpsProcedure;

    inline int add_int(ObObj &dest, const ObObj &sour)
    {
      int64_t a = 0, b = 0;
      dest.get_int(a);
      sour.get_int(b);
      dest.set_int(a + b);
      return OB_SUCCESS;
    }

    inline int add_double(ObObj &dest, const ObObj &sour)
    {
      double a = 0, b = 0;
      dest.get_double(a);
      sour.get_double(b);
      dest.set_double(a + b);
      return OB_SUCCESS;
    }

    struct BasicParam
    {
        BasicParam(uint64_t table_id, int64_t column_count, ObLockFlag flag, int64_t static_data_id) :
          table_id_(table_id), column_count_(column_count), lock_flag_(flag), static_data_id_(static_data_id)
        {
          row_desc_.reset();

          version_range_.border_flag_.set_inclusive_start();
          version_range_.border_flag_.set_max_value();
          version_range_.start_version_.major_ = version_major;
          version_range_.start_version_.minor_ = version_minor;
          version_range_.start_version_.is_final_minor_ = is_final_minor;
        }

        //query structure
        ObObj keys_[4];

        uint64_t table_id_;
        uint64_t key_column_ids_[4];
        uint64_t column_ids_[16];
        int64_t  column_count_;

        ObLockFlag lock_flag_;
        ObVersionRange version_range_;
        ObRowDesc row_desc_;
        ObRowDesc write_desc_;
        int64_t static_data_id_;

        static const int32_t version_major = 2;
        static const int16_t version_minor = 0;
        static const int16_t is_final_minor = 0;

        virtual void project_row(ObRow &row, ObStringBuf *str_buf)
        {
          UNUSED(row);
          UNUSED(str_buf);
        }
    };

    struct SelectItemParam : BasicParam
    {
        ObObj &o_i_id_;

        double *i_price_;
        ObString *i_name_;
        ObString *i_data_;

        SelectItemParam() : BasicParam(3004, 4, LF_NONE, 0), o_i_id_(keys_[0])
        {
          uint64_t temp_ids[] = {16, 18, 17, 19};
          for(int64_t i = 0; i < column_count_; ++i)
            column_ids_[i] = temp_ids[i];

          key_column_ids_[0] = 16;

          row_desc_.add_column_desc(table_id_, 16);
          row_desc_.add_column_desc(table_id_, 18);
          row_desc_.add_column_desc(table_id_, 17);
          row_desc_.add_column_desc(table_id_, 19);

          row_desc_.add_column_desc(OB_INVALID_ID, OB_ACTION_FLAG_COLUMN_ID);
          row_desc_.set_rowkey_cell_count(1);
        }

        void set_param(int o_i_id,
                       double *i_price, ObString *i_name, ObString *i_data)
        {
          o_i_id_.set_int(o_i_id);
          i_price_ = i_price;
          i_name_ = i_name;
          i_data_ = i_data;
        }

        void project_row(ObRow &row, ObStringBuf *str_buf)
        {
          const ObObj *cell;
          row.get_cell(table_id_, 18, cell);
          cell->get_double(*i_price_);

          row.get_cell(table_id_, 17, cell);
          cell->get_varchar(*i_name_);
          ob_write_string(*str_buf, *i_name_, *i_name_);

          row.get_cell(table_id_, 19, cell);
          cell->get_varchar(*i_data_);
          ob_write_string(*str_buf, *i_data_, *i_data_);
        }
    };

    struct SelectStockParam : BasicParam
    {
        //runtime parameters
        ObObj& ol_supply_w_id_;
        ObObj& o_i_id_;

        int *s_quantity_;
        ObString *s_data_;
        ObString *s_dist_;
        SelectStockParam() : BasicParam(3008, 14, LF_WRITE, 1), ol_supply_w_id_(keys_[0]), o_i_id_(keys_[1])
        {
          uint64_t temp_ids[] = {16, 17, 18, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32};

          for(int64_t i = 0; i < column_count_; ++i)
            column_ids_[i] = temp_ids[i];

          key_column_ids_[0] = 16;
          key_column_ids_[1] = 17;

          row_desc_.add_column_desc(3008, 16);
          row_desc_.add_column_desc(3008, 17);
          row_desc_.add_column_desc(3008, 18);

          for(uint64_t i = 22; i <= 32; ++i)
          {
            row_desc_.add_column_desc(3008, i);
          }

          row_desc_.add_column_desc(OB_INVALID_ID, OB_ACTION_FLAG_COLUMN_ID);
          row_desc_.set_rowkey_cell_count(2);
        }

        void set_param(int ol_i_id, int ol_supply_w_id, int *s_quantity, ObString *s_data, ObString s_dist[])
        {
          o_i_id_.set_int(ol_i_id);
          ol_supply_w_id_.set_int(ol_supply_w_id);

          s_quantity_ = s_quantity;
          s_data_ = s_data;
          s_dist_ = s_dist;
        }

        void project_row(ObRow &row, ObStringBuf *str_buf)
        {
          const ObObj *cell;
          int ret = OB_SUCCESS;
          double s_tmp = 0;
          if( OB_SUCCESS != ret ) {}
          else if( OB_SUCCESS != (ret = row.get_cell(table_id_, 18, cell)) )
          {
            TBSYS_LOG(WARN, "failed to get s_quantity");
          }
          else
          {
            cell->get_double(s_tmp);
            *s_quantity_ = (int)s_tmp;
            TBSYS_LOG(TRACE, "s_quantity: %d", *s_quantity_);
          }
          if( OB_SUCCESS != ret ) {}
          else if( OB_SUCCESS != (ret = row.get_cell(table_id_, 22, cell)))
          {
            TBSYS_LOG(WARN, "failed to get s_data");
          }
          else
          {
            cell->get_varchar(*s_data_);
            ob_write_string(*str_buf, *s_data_, *s_data_);
            TBSYS_LOG(TRACE, "s_data: %.*s", s_data_->length(), s_data_->ptr());
          }

          for(int i = 0; i < 10 && OB_SUCCESS == ret; ++i)
          {
            if( OB_SUCCESS != (ret = row.get_cell(table_id_, 23 + i, cell)) )
            {
              TBSYS_LOG(WARN, "failed to get s_dist_info");
            }
            else
            {
              cell->get_varchar(s_dist_[i]);
              ob_write_string(*str_buf, s_dist_[i], s_dist_[i]);
              TBSYS_LOG(TRACE, "s_dist_%d: %.*s", i, s_dist_[i].length(), s_dist_[i].ptr());
            }
          }
        }
    };


    struct UpdateStockParam : BasicParam
    {
        ObObj &ol_supply_w_id_;
        ObObj &o_i_id_;

        ObObj s_quantity_;
        ObObj o_quantity_;
        ObObj s_remote_cnt_increment_;


        UpdateStockParam() : BasicParam(3008, 6, LF_WRITE, 2), ol_supply_w_id_(keys_[0]), o_i_id_(keys_[1])
        {
          uint64_t temp_ids[] = {16, 17, 18, 19, 20, 21};

          for(int64_t i = 0; i < column_count_; ++i)
            column_ids_[i] = temp_ids[i];

          key_column_ids_[0] = 16;
          key_column_ids_[1] = 17;

          write_desc_.reset();
          for(uint64_t i = 16; i <= 21; ++i)
          {
            write_desc_.add_column_desc(3008, i);
            row_desc_.add_column_desc(3008, i);
          }

          row_desc_.add_column_desc(OB_INVALID_ID, OB_ACTION_FLAG_COLUMN_ID);
          write_desc_.set_rowkey_cell_count(2);
          row_desc_.set_rowkey_cell_count(2);
        }

        void set_param(int ol_i_id, int ol_supply_w_id, int s_quantity,
                       double o_quantity, int s_remote_cnt_increment)
        {
          ol_supply_w_id_.set_int(ol_supply_w_id);
          o_i_id_.set_int(ol_i_id);

          s_quantity_.set_int(s_quantity);
          o_quantity_.set_double(o_quantity);
          s_remote_cnt_increment_.set_int(s_remote_cnt_increment);
        }

        void project_row(ObRow &row, ObStringBuf *str_buf)
        {
          UNUSED(str_buf);
          ObObj *cell;
          row.set_cell(table_id_, 18, s_quantity_);

          row.get_cell(table_id_, 19, cell);
          add_double(o_quantity_, *cell);
          row.set_cell(table_id_, 19, o_quantity_);

          row.get_cell(table_id_, 20, cell);
          ObObj tmp;
          tmp.set_int(1);
          add_int(tmp, *cell);
          row.set_cell(table_id_, 20, tmp);

          row.get_cell(table_id_, 21, cell);
          add_int(s_remote_cnt_increment_, *cell);
          row.set_cell(table_id_, 21, s_remote_cnt_increment_);

          row.set_row_desc(write_desc_);
        }
    };

    struct SelectDistrictParam : BasicParam
    {
        ObObj &d_w_id_;
        ObObj &d_id_;

        int *d_next_o_id_;
        double *d_tax_;
        SelectDistrictParam() : BasicParam(3002, 4, LF_WRITE, 3), d_w_id_(keys_[0]), d_id_(keys_[1])
        {
          uint64_t column_ids[] = {16, 17, 20, 19};

          for(int64_t i = 0; i < column_count_; ++i)
            column_ids_[i] = column_ids[i];

          key_column_ids_[0] = 16;
          key_column_ids_[1] = 17;

          row_desc_.add_column_desc(3002, 16);
          row_desc_.add_column_desc(3002, 17);
          row_desc_.add_column_desc(3002, 20);
          row_desc_.add_column_desc(3002, 19);

          row_desc_.add_column_desc(OB_INVALID_ID, OB_ACTION_FLAG_COLUMN_ID);
          row_desc_.set_rowkey_cell_count(2);
        }

        void set_param(int w_id, int d_id, int *d_next_o_id, double *d_tax)
        {
          d_w_id_.set_int(w_id);
          d_id_.set_int(d_id);
          d_next_o_id_ = d_next_o_id;
          d_tax_ = d_tax;
        }

        void project_row(ObRow &row, ObStringBuf *str_buf)
        {
          const ObObj *cell;
          UNUSED(str_buf);
          int64_t i_tmp = 0;
          row.get_cell(table_id_, 20, cell);
          cell->get_int(i_tmp);
          *d_next_o_id_ = (int)i_tmp;

          row.get_cell(table_id_, 19, cell);
          cell->get_double(*d_tax_);
        }
    };

    struct UpdateDistrictParam : BasicParam
    {
        ObObj &d_w_id_;
        ObObj &d_id_;

        UpdateDistrictParam() : BasicParam(3002, 3, LF_WRITE, 4), d_w_id_(keys_[0]), d_id_(keys_[1])
        {
          uint64_t column_ids[] = {16, 17, 20};

          for(int64_t i = 0; i < column_count_; ++i)
          {
            column_ids_[i] = column_ids[i];
          }

          key_column_ids_[0] = 16;
          key_column_ids_[1] = 17;

          write_desc_.reset();

          row_desc_.add_column_desc(3002, 16);
          row_desc_.add_column_desc(3002, 17);
          row_desc_.add_column_desc(3002, 20);
          row_desc_.add_column_desc(OB_INVALID_ID, OB_ACTION_FLAG_COLUMN_ID);
          row_desc_.set_rowkey_cell_count(2);

          write_desc_.add_column_desc(table_id_, 16); //table_id_ = 3002
          write_desc_.add_column_desc(table_id_, 17);
          write_desc_.add_column_desc(table_id_, 20);
          write_desc_.set_rowkey_cell_count(2);
        }

        void set_param(int w_id, int d_id)
        {
          d_w_id_.set_int(w_id);
          d_id_.set_int(d_id);
        }

        void project_row(ObRow &row, ObStringBuf *str_buf)
        {
          UNUSED(str_buf);
          const ObObj *cell;
          ObObj next_o_id;
          next_o_id.set_int(1);

          row.get_cell(table_id_, 20, cell);
          add_int(next_o_id, *cell);
          row.set_cell(table_id_, 20, next_o_id);

          row.set_row_desc(write_desc_);
        }
    };

    struct InsertOOrderParam
    {
        ObObj o_id_;         //16
        ObObj o_d_id_;       //17
        ObObj o_w_id_;       //18
        ObObj o_c_id_;       //19
        ObObj o_entry_d_;    //23
        ObObj o_ol_cnt_;     //21
        ObObj o_all_local_;  //22

        int64_t table_id_;
        ObRowDesc row_desc_;

        InsertOOrderParam() : table_id_(3006)
        {
          row_desc_.reset();
          uint64_t temp_cols[]= {16, 17, 18, 19, 23, 21, 22};
          for(int64_t i = 0; i < 7; ++i)
          {
            row_desc_.add_column_desc(table_id_, temp_cols[i]);
          }

          row_desc_.set_rowkey_cell_count(3);
        }

        void set_param(int o_id, int d_id, int w_id, int c_id,
                       int64_t ts, int o_ol_cnt, int o_all_local)
        {
          o_id_.set_int(o_id);
          o_d_id_.set_int(d_id);
          o_w_id_.set_int(w_id);
          o_c_id_.set_int(c_id);
          o_entry_d_.set_int(ts);
          o_ol_cnt_.set_int(o_ol_cnt);
          o_all_local_.set_int(o_all_local);
        }
    };

    struct InsertNewOrderParam
    {
        ObObj no_o_id_; //18
        ObObj no_d_id_; //17
        ObObj no_w_id_; //16

        int64_t table_id_;
        ObRowDesc row_desc_;

        InsertNewOrderParam() : table_id_(3005)
        {
          row_desc_.reset();
          row_desc_.add_column_desc(table_id_, 16);
          row_desc_.add_column_desc(table_id_, 17);
          row_desc_.add_column_desc(table_id_, 18);

          row_desc_.set_rowkey_cell_count(3);
        }

        void set_param(int o_id, int d_id, int w_id)
        {
          no_o_id_.set_int(o_id);
          no_d_id_.set_int(d_id);
          no_w_id_.set_int(w_id);
        }
    };

    struct InsertOrderLineParam
    {
        ObObj ol_o_id_;         //18
        ObObj ol_d_id_;         //17
        ObObj ol_w_id_;         //16
        ObObj ol_number_;       //19
        ObObj ol_i_id_;         //20
        ObObj ol_supply_w_id_;  //23
        ObObj ol_quantity_;     //24
        ObObj ol_amount_;       //22
        ObObj ol_dist_info_;    //25

        int64_t table_id_;
        ObRowDesc row_desc_;

        InsertOrderLineParam() : table_id_(3007)
        {
          uint64_t temp_cols[] = {16, 17, 18, 19, 20, 23, 24, 22, 25};

          row_desc_.reset();
          for(int i = 0; i < 9; ++i)
          {
            row_desc_.add_column_desc(table_id_, temp_cols[i]);
          }
          row_desc_.set_rowkey_cell_count(4);
        }

        void set_param(int o_id, int d_id, int w_id,
                       int ol_number, int ol_i_id, int ol_supply_w_id,
                       int ol_quantity, double ol_amount, const ObString &ol_dist_info)
        {
          ol_o_id_.set_int(o_id);
          ol_d_id_.set_int(d_id);
          ol_w_id_.set_int(w_id);
          ol_number_.set_int(ol_number);
          ol_i_id_.set_int(ol_i_id);
          ol_supply_w_id_.set_int(ol_supply_w_id);
          ol_quantity_.set_int(ol_quantity);
          ol_amount_.set_double(ol_amount);
